Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_LCDIFV2.h
#define LCDIFV2_CTRL_INV_HS_MASK                 (0x1U)
#define LCDIFV2_CTRL_INV_HS_SHIFT                (0U)
/*! INV_HS - Invert Horizontal synchronization signal
 *  0b0..HSYNC signal not inverted (active HIGH)
 *  0b1..Invert HSYNC signal (active LOW)
 */
#define LCDIFV2_CTRL_INV_HS(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_HS_SHIFT)) & LCDIFV2_CTRL_INV_HS_MASK)

#define LCDIFV2_CTRL_INV_VS_MASK                 (0x2U)
#define LCDIFV2_CTRL_INV_VS_SHIFT                (1U)
/*! INV_VS - Invert Vertical synchronization signal
 *  0b0..VSYNC signal not inverted (active HIGH)
 *  0b1..Invert VSYNC signal (active LOW)
 */
#define LCDIFV2_CTRL_INV_VS(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_VS_SHIFT)) & LCDIFV2_CTRL_INV_VS_MASK)

#define LCDIFV2_CTRL_INV_DE_MASK                 (0x4U)
#define LCDIFV2_CTRL_INV_DE_SHIFT                (2U)
/*! INV_DE - Invert Data Enable polarity
 *  0b0..Data enable is active high
 *  0b1..Data enable is active low
 */
#define LCDIFV2_CTRL_INV_DE(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_DE_SHIFT)) & LCDIFV2_CTRL_INV_DE_MASK)

#define LCDIFV2_CTRL_INV_PXCK_MASK               (0x8U)
#define LCDIFV2_CTRL_INV_PXCK_SHIFT              (3U)
/*! INV_PXCK - Polarity change of Pixel Clock
 *  0b0..Display samples data on the falling edge
 *  0b1..Display samples data on the rising edge
 */
#define LCDIFV2_CTRL_INV_PXCK(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_INV_PXCK_MASK)

#define LCDIFV2_CTRL_NEG_MASK                    (0x10U)
#define LCDIFV2_CTRL_NEG_SHIFT                   (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated
 *  0b0..Output is to remain same
 *  0b1..Output to be negated
 */
#define LCDIFV2_CTRL_NEG(x)                      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_NEG_SHIFT)) & LCDIFV2_CTRL_NEG_MASK)

#define LCDIFV2_CTRL_SW_RESET_MASK               (0x80000000U)
#define LCDIFV2_CTRL_SW_RESET_SHIFT              (31U)
/*! SW_RESET - Software Reset
 *  0b0..No action
 *  0b1..All LCDIFv2 internal registers are forced into their reset state. User registers are not affected
 */
#define LCDIFV2_CTRL_SW_RESET(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SW_RESET_SHIFT)) & LCDIFV2_CTRL_SW_RESET_MASK)
/*! @} */

/*! @name CTRL_SET - LCDIFv2 display control Register */
/*! @{ */

#define LCDIFV2_CTRL_SET_INV_HS_MASK             (0x1U)
#define LCDIFV2_CTRL_SET_INV_HS_SHIFT            (0U)
/*! INV_HS - Invert Horizontal synchronization signal */
#define LCDIFV2_CTRL_SET_INV_HS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_HS_SHIFT)) & LCDIFV2_CTRL_SET_INV_HS_MASK)

#define LCDIFV2_CTRL_SET_INV_VS_MASK             (0x2U)
#define LCDIFV2_CTRL_SET_INV_VS_SHIFT            (1U)
/*! INV_VS - Invert Vertical synchronization signal */
#define LCDIFV2_CTRL_SET_INV_VS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_VS_SHIFT)) & LCDIFV2_CTRL_SET_INV_VS_MASK)

#define LCDIFV2_CTRL_SET_INV_DE_MASK             (0x4U)
#define LCDIFV2_CTRL_SET_INV_DE_SHIFT            (2U)
/*! INV_DE - Invert Data Enable polarity */
#define LCDIFV2_CTRL_SET_INV_DE(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_DE_SHIFT)) & LCDIFV2_CTRL_SET_INV_DE_MASK)

#define LCDIFV2_CTRL_SET_INV_PXCK_MASK           (0x8U)
#define LCDIFV2_CTRL_SET_INV_PXCK_SHIFT          (3U)
/*! INV_PXCK - Polarity change of Pixel Clock */
#define LCDIFV2_CTRL_SET_INV_PXCK(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_SET_INV_PXCK_MASK)

#define LCDIFV2_CTRL_SET_NEG_MASK                (0x10U)
#define LCDIFV2_CTRL_SET_NEG_SHIFT               (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated */
#define LCDIFV2_CTRL_SET_NEG(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_NEG_SHIFT)) & LCDIFV2_CTRL_SET_NEG_MASK)

#define LCDIFV2_CTRL_SET_SW_RESET_MASK           (0x80000000U)
#define LCDIFV2_CTRL_SET_SW_RESET_SHIFT          (31U)
/*! SW_RESET - Software Reset */
#define LCDIFV2_CTRL_SET_SW_RESET(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_SW_RESET_SHIFT)) & LCDIFV2_CTRL_SET_SW_RESET_MASK)
/*! @} */

/*! @name CTRL_CLR - LCDIFv2 display control Register */
/*! @{ */

#define LCDIFV2_CTRL_CLR_INV_HS_MASK             (0x1U)
#define LCDIFV2_CTRL_CLR_INV_HS_SHIFT            (0U)
/*! INV_HS - Invert Horizontal synchronization signal */
#define LCDIFV2_CTRL_CLR_INV_HS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_HS_SHIFT)) & LCDIFV2_CTRL_CLR_INV_HS_MASK)

#define LCDIFV2_CTRL_CLR_INV_VS_MASK             (0x2U)
#define LCDIFV2_CTRL_CLR_INV_VS_SHIFT            (1U)
/*! INV_VS - Invert Vertical synchronization signal */
#define LCDIFV2_CTRL_CLR_INV_VS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_VS_SHIFT)) & LCDIFV2_CTRL_CLR_INV_VS_MASK)

#define LCDIFV2_CTRL_CLR_INV_DE_MASK             (0x4U)
#define LCDIFV2_CTRL_CLR_INV_DE_SHIFT            (2U)
/*! INV_DE - Invert Data Enable polarity */
#define LCDIFV2_CTRL_CLR_INV_DE(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_DE_SHIFT)) & LCDIFV2_CTRL_CLR_INV_DE_MASK)

#define LCDIFV2_CTRL_CLR_INV_PXCK_MASK           (0x8U)
#define LCDIFV2_CTRL_CLR_INV_PXCK_SHIFT          (3U)
/*! INV_PXCK - Polarity change of Pixel Clock */
#define LCDIFV2_CTRL_CLR_INV_PXCK(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_CLR_INV_PXCK_MASK)

#define LCDIFV2_CTRL_CLR_NEG_MASK                (0x10U)
#define LCDIFV2_CTRL_CLR_NEG_SHIFT               (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated */
#define LCDIFV2_CTRL_CLR_NEG(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_NEG_SHIFT)) & LCDIFV2_CTRL_CLR_NEG_MASK)

#define LCDIFV2_CTRL_CLR_SW_RESET_MASK           (0x80000000U)
#define LCDIFV2_CTRL_CLR_SW_RESET_SHIFT          (31U)
/*! SW_RESET - Software Reset */
#define LCDIFV2_CTRL_CLR_SW_RESET(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_SW_RESET_SHIFT)) & LCDIFV2_CTRL_CLR_SW_RESET_MASK)
/*! @} */

