Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_LCDIFV2.h
/* The count of LCDIFV2_CTRLDESCL3 */
#define LCDIFV2_CTRLDESCL3_COUNT                 (8U)

/*! @name CTRLDESCL4 - Control Descriptor Layer 4 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL4_ADDR_MASK             (0xFFFFFFFFU)
#define LCDIFV2_CTRLDESCL4_ADDR_SHIFT            (0U)
/*! ADDR - Address of layer data in the memory. The address programmed should be 64-bit aligned */
#define LCDIFV2_CTRLDESCL4_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL4_ADDR_SHIFT)) & LCDIFV2_CTRLDESCL4_ADDR_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL4 */
#define LCDIFV2_CTRLDESCL4_COUNT                 (8U)

/*! @name CTRLDESCL5 - Control Descriptor Layer 5 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL5_AB_MODE_MASK          (0x3U)
#define LCDIFV2_CTRLDESCL5_AB_MODE_SHIFT         (0U)
/*! AB_MODE - Alpha Blending Mode
 *  0b00..No alpha Blending (The SAFETY_EN bit need set to 1)
 *  0b01..Blend with global ALPHA
 *  0b10..Blend with embedded ALPHA
 *  0b11..Blend with PoterDuff enable
 */
#define LCDIFV2_CTRLDESCL5_AB_MODE(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_AB_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_AB_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_MASK   (0x30U)
#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_SHIFT  (4U)
/*! PD_FACTOR_MODE - PoterDuff factor mode
 *  0b00..Using 1
 *  0b01..Using 0
 *  0b10..Using straight alpha
 *  0b11..Using inverse alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE(x)     (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_MASK (0xC0U)
#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_SHIFT (6U)
/*! PD_GLOBAL_ALPHA_MODE - PoterDuff global alpha mode
 *  0b00..Using global alpha
 *  0b01..Using local alpha
 *  0b10..Using scaled alpha
 *  0b11..Using scaled alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_MASK    (0x100U)
#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_SHIFT   (8U)
/*! PD_ALPHA_MODE - PoterDuff alpha mode
 *  0b0..Straight mode for Porter Duff alpha
 *  0b1..Inversed mode for Porter Duff alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_MASK    (0x200U)
#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_SHIFT   (9U)
/*! PD_COLOR_MODE - PoterDuff alpha mode
 *  0b0..Straight mode for Porter Duff color
 *  0b1..Inversed mode for Porter Duff color
 */
#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_YUV_FORMAT_MASK       (0xC000U)
#define LCDIFV2_CTRLDESCL5_YUV_FORMAT_SHIFT      (14U)
/*! YUV_FORMAT - The YUV422 input format selection
 *  0b00..The YVYU422 8bit sequence is U1,Y1,V1,Y2
 *  0b01..The YVYU422 8bit sequence is V1,Y1,U1,Y2
 *  0b10..The YVYU422 8bit sequence is Y1,U1,Y2,V1
 *  0b11..The YVYU422 8bit sequence is Y1,V1,Y2,U1
 */
#define LCDIFV2_CTRLDESCL5_YUV_FORMAT(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_YUV_FORMAT_SHIFT)) & LCDIFV2_CTRLDESCL5_YUV_FORMAT_MASK)

#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_MASK     (0xFF0000U)
#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_SHIFT    (16U)
/*! GLOBAL_ALPHA - Global Alpha */
#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA(x)       (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_SHIFT)) & LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_MASK)

#define LCDIFV2_CTRLDESCL5_BPP_MASK              (0xF000000U)
#define LCDIFV2_CTRLDESCL5_BPP_SHIFT             (24U)
/*! BPP - Layer encoding format (bit per pixel)
 *  0b0000..1 bpp
 *  0b0001..2 bpp
 *  0b0010..4 bpp
 *  0b0011..8 bpp
 *  0b0100..16 bpp (RGB565)
 *  0b0101..16 bpp (ARGB1555)
 *  0b0110..16 bpp (ARGB4444)
 *  0b0111..YCbCr422 (Only layer 0/1 can support this format)
 *  0b1000..24 bpp (RGB888)
 *  0b1001..32 bpp (ARGB8888)
 *  0b1010..32 bpp (ABGR8888)
 */
#define LCDIFV2_CTRLDESCL5_BPP(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_BPP_SHIFT)) & LCDIFV2_CTRLDESCL5_BPP_MASK)

#define LCDIFV2_CTRLDESCL5_SAFETY_EN_MASK        (0x10000000U)
#define LCDIFV2_CTRLDESCL5_SAFETY_EN_SHIFT       (28U)
/*! SAFETY_EN - Safety Mode Enable Bit
 *  0b0..Safety Mode is disabled
 *  0b1..Safety Mode is enabled for this layer
 */
#define LCDIFV2_CTRLDESCL5_SAFETY_EN(x)          (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_SAFETY_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_SAFETY_EN_MASK)

#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_MASK   (0x40000000U)
#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_SHIFT  (30U)
/*! SHADOW_LOAD_EN - Shadow Load Enable */
#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_MASK)

#define LCDIFV2_CTRLDESCL5_EN_MASK               (0x80000000U)
#define LCDIFV2_CTRLDESCL5_EN_SHIFT              (31U)
/*! EN - Enable the layer for DMA
 *  0b0..OFF
 *  0b1..ON
 */
#define LCDIFV2_CTRLDESCL5_EN(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_EN_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL5 */
#define LCDIFV2_CTRLDESCL5_COUNT                 (8U)

/*! @name CTRLDESCL6 - Control Descriptor Layer 6 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL6_BCLR_B_MASK           (0xFFU)
#define LCDIFV2_CTRLDESCL6_BCLR_B_SHIFT          (0U)
/*! BCLR_B - Background B component value */
#define LCDIFV2_CTRLDESCL6_BCLR_B(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_B_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_B_MASK)

#define LCDIFV2_CTRLDESCL6_BCLR_G_MASK           (0xFF00U)
#define LCDIFV2_CTRLDESCL6_BCLR_G_SHIFT          (8U)
/*! BCLR_G - Background G component value */
#define LCDIFV2_CTRLDESCL6_BCLR_G(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_G_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_G_MASK)

#define LCDIFV2_CTRLDESCL6_BCLR_R_MASK           (0xFF0000U)
#define LCDIFV2_CTRLDESCL6_BCLR_R_SHIFT          (16U)
/*! BCLR_R - Background R component value */
#define LCDIFV2_CTRLDESCL6_BCLR_R(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_R_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_R_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL6 */
#define LCDIFV2_CTRLDESCL6_COUNT                 (8U)

/*! @name CSC_COEF0 - Color Space Conversion Coefficient Register 0 */
/*! @{ */

#define LCDIFV2_CSC_COEF0_Y_OFFSET_MASK          (0x1FFU)
#define LCDIFV2_CSC_COEF0_Y_OFFSET_SHIFT         (0U)
/*! Y_OFFSET - Two's compliment amplitude offset implicit in the Y data. For YUV, this is typically
 *    0 and for YCbCr, this is typically -16 (0x1F0)
 */
#define LCDIFV2_CSC_COEF0_Y_OFFSET(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_Y_OFFSET_SHIFT)) & LCDIFV2_CSC_COEF0_Y_OFFSET_MASK)

#define LCDIFV2_CSC_COEF0_UV_OFFSET_MASK         (0x3FE00U)
#define LCDIFV2_CSC_COEF0_UV_OFFSET_SHIFT        (9U)
/*! UV_OFFSET - Two's compliment phase offset implicit for CbCr data. Generally used for YCbCr to
 *    RGB conversion. YCbCr=0x180, YUV=0x000 (typically -128 or 0x180 to indicate normalized -0.5 to
 *    0.5 range)
 */
#define LCDIFV2_CSC_COEF0_UV_OFFSET(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_UV_OFFSET_SHIFT)) & LCDIFV2_CSC_COEF0_UV_OFFSET_MASK)

#define LCDIFV2_CSC_COEF0_C0_MASK                (0x1FFC0000U)
#define LCDIFV2_CSC_COEF0_C0_SHIFT               (18U)
/*! C0 - Two's compliment Y multiplier coefficient. YUV=0x100 (1.000) YCbCr=0x12A (1.164) */
#define LCDIFV2_CSC_COEF0_C0(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_C0_SHIFT)) & LCDIFV2_CSC_COEF0_C0_MASK)

